app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'olu1@gmail.com'
 LIMIT 1
---
    function check()
    {
        $validation = $this->validate([
            'email' => [
                'rules' => 'required|valid_email|is_not_unique[users.email]',
                'errors' => [
                    'required' => 'Email is required',
                    'valid_email' => 'Enter a valid email address',
                    'is_not_unique' => 'This is not registered on our server'
                ]
            ],
            'password' => [
                'rules' => 'required|min_length[5]|max_length[12]',
                'errors' => [
                    'required' => 'Password is required',
                    'min_length' => 'Password must have atleast 5 character in length',
                    'max_length' => 'Password must not have more than 12 character in length'
                ]
            ]
        ]);

        if (!$validation) {
            return view('pages/login', ['validation' => $this->validator]);
        } else {
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');
            $usersModel = new \App\Models\UsersModel();
            $user_info = $usersModel->where('email', $email)->first();

SELECT *
FROM `users`
WHERE `users`.`id` = '7'
---
    public function dashboard()
    {
        $usersModel = new \App\Models\UsersModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $usersModel->find($loggedUserID);

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function profile()
    {
        $usersModel = new \App\Models\UsersModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $usersModel->find($loggedUserID);