app/Models/ProductModel.php

SELECT *
FROM `products`
WHERE `slug` = 'good'
 LIMIT 1
---
    public function getPosts($slug = null){
        if(!$slug){
            return $this->findAll();
        }

        return $this->asArray()
                    ->where(['slug' => $slug])
                    ->first();

SELECT *
FROM `products`
ORDER BY `created_at` DESC
---
    public function getProducts($slug = null)
    {
        if (!$slug) {
            return $this->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `products`
ORDER BY `pcategory` DESC
---
    public function getRelatedProducts($pcategory = null)
    {
        if (!$pcategory) {
            return $this->orderBy('pcategory', 'DESC')->findAll();